'use strict';

/**
 * @ngdoc service
 * @name generatorAngularTestApp.masterDataPopulator
 * @description
 * # masterHospitals
 * Factory in the generatorAngularTestApp.
 */
angular.module('janasanthwanamApp')
    .factory('masterHospitals', function () {

            var hospitals = [{
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "കമ്മ്യൂണിറ്റി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍, കല്ലറ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ജില്ല ആശുപത്രി, നെടുമങ്ങാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ജില്ല ആശുപത്രി,നെയ്യാറ്റിന്‍കര",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ജില്ല മോഡല്‍ ആശുപത്രി, പേരൂര്‍ക്കട",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ജനറല്‍ ആശുപത്രി, തിരുവനന്തപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ഗവ: ആയുര്‍വേദ ആശുപത്രി,പുളിമാത്ത്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ഗവ: ആയുര്‍വേദ മെഡിക്കല്‍ കോളേജ്,തിരുവനതപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ഗവ:ഡിസ്പെന്‍സറി,കട്ടുപുരം,പുളിമാത്ത്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ഗവ:ഫോര്‍ട്ട്‌ ആശുപത്രി,തിരുവനന്തപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ഗവ:ജില്ല ആയുര്‍വേദ ആശുപത്രി,വര്‍ക്കല",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "കേരള മെഡിക്കല്‍ സര്‍വീസ് കോര്‍പറേഷന്‍ ലിമിറ്റഡ്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,തിരുവനന്തപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "പി എച് സി,ആനക്കുടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "പി എച് സി,കല്ലറ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "പി എച് സി,പരനിയം, പൂവര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "പി എച് സി,പുല്ലുവിള",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "പ്രൈമറി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍,ആനാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "പ്രൈമറി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍,വാമനപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "പ്രൈമറി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍,തിരുവല്ലം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "റീജിനല്‍ കാന്‍സര്‍ സെന്‍റെര്‍, തിരുവനതപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "എസ് എ ടി ആശുപത്രി, തിരുവന്തപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "സ്പെഷ്യല്‍ സാന്‍ഷന്‍ ഫോര്‍ എച് ക്യു",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "എസ് സി ടി ആശുപത്രി, തിരുവന്തപുരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,ആറ്റിങ്ങല്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,ഫോര്‍ട്ട്‌     ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "അല്‍ ആരിഫ് ആശുപത്രി,അമ്പലത്തറ",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "സി എസ് ഐ മെഡിക്കല്‍ കോളേജ്,കാരക്കോണം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ജൂബിലി ആശുപത്രി,ബേക്കറി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "കിംസ് പിന്നാക്കിള്‍, തിരുവനന്തപുരം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "മേടിട്രീന ആശുപത്രി,തിരുവനന്തപുരം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "നിംസ് മെഡിസിറ്റി, തിരുവനന്തപുരം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "സരസ്വതി ആശുപത്രി, തിരുവനതപുരം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ശിവഗിരി ശ്രീ നാരായണ മെഡിക്കല്‍ മിഷന്‍ ആശുപത്രി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ശ്രീ ഗോകുലം മെഡിക്കല്‍ കോളേജ്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "എസ് യു ടി ആശുപത്രി, വട്ടപ്പാറ",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "സെന്‍റ് ജോണ്‍ ഹെല്‍ത്ത്‌ സര്‍വീസ്,പിരപ്പിന്‍കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തിരുവനന്തപുരം",
                    "HOSP": "ഇന്ത്യ ആസുപത്രി, മേലെ തമ്പാനൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "ജില്ല ആശുപത്രി, കൊല്ലം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,കരുനാഗപ്പള്ളി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,കൊട്ടാരക്കര",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "താലുക്ക് ആശുപത്രി, പുനലൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "അസീസിയ മെഡിക്കല്‍ കോളേജ്,മേയ്യന്നൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "ബിഷപ്‌ ബെന്‍സിഗര്‍ ആശുപത്രി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "ഹോളി ക്രോസ് ആശുപത്രി,കൊട്ടിയം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "എന്‍ എസ് മെമ്മോറിയല്‍ ആശുപത്രി,കൊല്ലം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "പദ്മാവതി മെഡിക്കല്‍ ഫൌണ്ടേഷന്‍,ശാസതാംകോട്ട",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "പോയനില്‍ ആശുപത്രി,പുനലൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "ശ്രീ നാരായണ ട്രസ്റ്റ്‌ മെഡിക്കല്‍ മിഷന്‍,കൊല്ലം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "ശ്രീ സത്യാ സായി സൂപ്പര്‍ സ്പെഷ്യലിറ്റി ആശുപത്രി,പുളമന്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "സെന്‍റ് ജോസഫ്‌ മിഷന്‍ ആശുപത്രി,അഞ്ചല്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കൊല്ലം",
                    "HOSP": "ട്രാവന്‍കൂര്‍ മെഡിക്കല്‍കോളേജ്,കൊല്ലം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "ജില്ല ആശുപത്രി,പത്തനംതിട്ട",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,പത്തനംതിട്ട",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,അടൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "ഗവ താലുക്ക് ആശുപത്രി,റാന്നി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,തിരുവല്ല",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,മല്ലപ്പള്ളി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "താലുക്ക് ആശുപത്രി, അടൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "ക്രിസ്ത്യന്‍ മിഷന്‍ ആശുപത്രി,പത്തനംതിട്ട",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "ഫെല്ലോഷിപ്പ് മിഷന്‍ ആശുപത്രി,പത്തനംതിട്ട",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "മുത്തൂറ്റ് മെഡിക്കല്‍ സെന്‍റെര്‍,പത്തനംതിട്ട",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "പുഷ്പഗിരി മെഡിക്കല്‍ കോളേജ്,തിരുവല്ല",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "സെന്‍റ് ഗ്രിഗോറിയസ് മെഡിക്കല്‍ മിഷന്‍ ആശുപത്രി,പാറുമല",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "സെന്‍റ് തോമസ്‌ ആശുപത്രി,മാലക്കര",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പത്തനംതിട്ട",
                    "HOSP": "തിരുവല്ല മെഡിക്കല്‍ മിഷന്‍,തിരുവല്ല",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,ആലപ്പുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "ഗവ താലുക്ക് ആശുപത്രി,ചേര്‍ത്തല",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "ഗവ താലുക്ക് ആശുപത്രി,ചെങ്ങന്നൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "ഗവ താലുക്ക് ആശുപത്രി,തുറവൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,ആലപ്പുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "ഡബ്ലു & സി ആശുപത്രി,കടപ്പുറം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,ആലപ്പുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "എം എസ് ജിആര്‍ ജോസഫ്കണ്ടത്തില്‍മെമ്മോറിയല്‍ കാന്‍സര്‍റിസേര്‍ച് സെന്‍റെര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "ആലപ്പുഴ",
                    "HOSP": "സഞ്ജീവനി മള്‍ടി സ്പെഷാലിറ്റി ആശുപത്രി,ചെങ്ങന്നൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "ജില്ല ആശുപത്രി,കോട്ടയം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,ചങ്ങനാശ്ശേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,പാല",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,കോട്ടയം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,കോട്ടയം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,കുറവിലങ്ങാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,പാമ്പാടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,വൈക്കം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "ഭരത് ആശുപത്രി,കോട്ടയം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "കറിടാസ് ആസിപത്രി,കോട്ടയം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "ഇന്‍ഡോ അമേരിക്കന്‍ ആശുപത്രി,വൈക്കം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "സെന്‍റ് തോമസ്‌ ആശുപത്രി,കോട്ടയം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോട്ടയം",
                    "HOSP": "കിഴിതടിയൂര്‍ സര്‍വീസ് കോ-ഓപ്പറെറ്റിവ് ബാങ്ക്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "ബ്ലോക്ക് പ്രൈമറി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍,പാമ്പാടുംപാറ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "കമ്മ്യുണിറ്റി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍,മുട്ടം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "ഡി എച് ആശുപത്രി,ഇടുക്കി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "ഗവ: എ എച്,ഇടുക്കി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,ഇടുക്കി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "പി എച് സി, അരക്കുളം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "പി എച് സി,തട്ടക്കുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "താലുക്ക് ആശുപത്രി,അടിമാലി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "താലുക്ക് ആശുപത്രി,ഇടുക്കി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "താലുക്ക് ആശുപത്രി,നെടുങ്ങണ്ടം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "താലുക്ക് ആശുപത്രി,തൊടുപുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "പി എച് സി,ദേവിയൂര്‍ കോളനി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "പി എച് സി,തട്ടാക്കുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "ചാഴിക്കാട്ടു ആശുപത്രി,ഇടുക്കി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "ഹോളി ഫാമിലി ആശുപത്രി,ഇടുക്കി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "ഇടുക്കി ഡിസ്ട്രിക് കോ ഓപ്പറേഷന്‍ ആശുപത്രി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "സെന്‍റ് ജോണ്‍സ് ആശുപത്രി,കട്ടപ്പന",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "ഇടുക്കി",
                    "HOSP": "സെന്‍റ് മേരീസ് ആശുപത്രി,ഇടുക്കി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "കൊച്ചിന്‍ കാന്‍സര്‍ റിസര്‍ച് സെന്‍റെര്‍,എറണകുളം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "കമ്മ്യൂണിറ്റി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ജില്ല ആശുപത്രി,ആലുവ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,എറണകുളം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,മൂവാറ്റുപുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "പി എച് സി,കോടനാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,എഫ് പി ആര്‍ ടി കൊച്ചി ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി, കോതമംഗലം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,മൂവാറ്റുപുഴ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,പെരുമ്പാവൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ആസ്ടെര്‍ ഡി എം ഹെല്‍ത്ത്‌ കെയര്‍ പ്രൈവറ്റ് ലിമിറ്റഡ്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "സിറ്റി ആശുപത്രി,എറണകുളം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ഫാത്തിമ ആശുപത്രി,പല്ലുരുത്തി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "കിംസ് ആശുപത്രി,എടപ്പള്ളി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ലിസി ആശുപത്രി,എറണകുളം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ലിറ്റില്‍ ഫ്ലവര്‍ ആശുപത്രി,അങ്കമാലി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ലോഡ്സ് ആശുപത്രി,പച്ചാളം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "എം എ ജി ആശുപത്രി,എടപ്പള്ളി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "പി എസ് മിഷന്‍ ആശുപത്രി,കൊച്ചി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "സമരിടന്‍ ആശുപത്രി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "മാര്‍ ബാസിലിയോസ് ആശുപത്രി,കോതമംഗലം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "സ്പെഷിലൈസ് ആശുപത്രി,എറണാകുളം നോര്‍ത്ത്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "ശ്രീ നാരായണ ഇന്‍സ്റ്റിറ്റ്യൂട്ട് ഓഫ് മെഡിക്കല്‍ സയന്‍സ്,ചാലക്ക",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "സെന്‍റ് ജോര്‍ജ് ആശുപത്രി,മൂവാറ്റുപുഴ",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "എറണകുളം",
                    "HOSP": "വിജയ കുമാര മേനോന്‍ ആശുപത്രി,ത്രിപ്പുണിതുറ",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "കമ്മ്യുണിറ്റി ഹെല്‍ത്ത്‌ സെന്‍റെര്‍,ചേലക്കര",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,തൃശൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,തൃശൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "ന്യൂ മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,തൃശൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "പി എച് സി,വടക്കാഞ്ചേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,ചാലക്കുടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,കൊടുങ്ങല്ലൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "താലുക്ക് ആശുപത്രി,കുന്നംകുളം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "താലുക്ക് ആശുപത്രി,പുദുകാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "അമല കാന്‍സര്‍ ആശുപത്രി,തൃശൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "ദയ ജനറല്‍ ആശുപത്രി,തൃശൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "ജൂബിലി മിഷന്‍ മെഡിക്കല്‍ കോളേജ്,തൃശൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "മോഡേണ്‍ ഹോസ്പിടല്‍ ചാരിറ്റീസ്,കൊടുങ്ങല്ലൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "രാജാ ചരിറ്റബള്‍മെഡിക്കല്‍ ട്രസ്റ്റ്‌,ചാവക്കാട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "മേട്രോപോളിഷന്‍ ആശുപത്രി,തൃശൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "റോയല്‍ ആശുപത്രി,കുന്നുകുളം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "സെന്‍റ് ജെയിംസ്‌ ആശുപത്രി,ചാലക്കുടി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "തൃശൂര്‍",
                    "HOSP": "സെന്‍റ് ജോസഫ് ആശുപത്രി,ചൂണ്ടല്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "കമ്മ്യുണിറ്റി ഹെല്‍ത്ത്‌ സെന്‍റെര്,ചല്ലിശ്ശേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ഡിസ്ട്രിക് കോ ഓപ്പറേഷന്‍ ആശുപത്രി,പാലക്കാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ഡിസ്ട്രിക് ആശുപത്രി,പാലക്കാട്‌",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,ഷോര്‍ണ്ണൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ഗവ: ആശുപത്രി,നെന്മാറ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ഗവ: ആശുപത്രി,മണ്ണാര്‍ക്കാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ഗവ: ആശുപത്രി,പട്ടാമ്പി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ഗവ: ആയുര്‍വേദ ആശുപത്രി,വടക്കാഞ്ചേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,ഒറ്റപ്പാലം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,അയിലൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,അയിലൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,കൊഴല്‍മന്നം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,കൊഴല്‍മന്നം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,കുതനുര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,മേലാര്‍കോട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,പെരുവെമ്പ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,പുതുക്കോട് ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,പുതുനഗരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി എച് സി,തേന്‍കുറുശശി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പാലക്കാട്‌ താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,ചിറ്റൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "താലുക്ക് ആശുപത്രി,ആലത്തൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "താലുക്ക് ആശുപത്രി,ചിറ്റൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "താലുക്ക് ആശുപത്രി,മണ്ണാര്‍ക്കാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "കരുണ മെഡിക്കല്‍ കോളേജ്,ചിറ്റൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "ലക്ഷ്മി ആശുപത്രി,പാലക്കാട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "മദര്‍ കെയര്‍ & ഹെല്‍ത്ത്‌ സെന്‍റെര്‍,മണ്ണാര്‍ക്കാട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പാലാന ഇന്‍സ്റ്റിറ്റ്യൂട്ട് ഓഫ് മെഡിക്കല്‍ സയന്‍സ്,കണ്ണാടി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "പി കെ ദാസ് ഇന്‍സ്റ്റിറ്റ്യൂട്ട് ഓഫ് മെഡിക്കല്‍ സയന്‍സ്,ഒറ്റപ്പാലം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "രാജിവ് ഗാന്ധി കോ ഓപ്പറെറ്റിവ് ആശുപത്രി,കല്ലേക്കാട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "സേവന ഹോസ്പിടല്‍ & റിസേര്‍ച് സെന്‍റെര്‍,പട്ടാമ്പി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "തങ്കം ഹോസ്പിടല്‍ ഓഫ് പി എം ആര്‍ സി,വെസ്റ്റ് യാക്കര",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "പാലക്കാട്‌",
                    "HOSP": "വള്ളുവനാട് ഹോസ്പിടല്‍ കംപ്ലെക്സ്‌,ഒറ്റപ്പാലം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "സി എച് സി, ഇടവന്ന",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "സി എച് സി,പുറത്തൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "സി എച് സി,വേങ്ങര",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "കമ്മ്യുണിറ്റി ഹെല്‍ത്ത്‌ സെന്‍റെര്,താനൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "ജില്ല ആശുപത്രി,മഞ്ചേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "ജില്ല ആശുപത്രി,തിരൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,മഞ്ചേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,നിലമ്പൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,തിരു അങ്ങാടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,പൊന്നാനി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "താലുക്ക് ആശുപത്രി,പെരുന്തല്‍മന്ന",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,മലപ്പുറം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "പി എച് സി,കാവനൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "അല്‍ മാസ് ആശുപത്രി,കോട്ടക്കല്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "അല്‍ ശിഫ ആശുപത്രി,പെരുന്തല്‍മന്ന",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "ഇ എം എസ് മെമ്മോറിയല്‍ ആശുപത്രി,പെരുന്തല്‍മന്ന",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "മലബാര്‍ ഇന്‍സ്റ്റിറ്റ്യൂട്ട് ഓഫ് മെഡിക്കല്‍ സ്കിഎന്കേ,കോട്ടക്കല്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "പ്രശാന്തി ഹൈ ടെക് ആശുപത്രി,മഞ്ചേരി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "മലപ്പുറം",
                    "HOSP": "എം ഇ എസ് മെഡിക്കല്‍ കോളേജ്,പെരുന്തല്‍മന്ന",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ഡിസ്ട്രിക് കോ ഓപ്പറേഷന്‍ ആശുപത്രി,കോഴിക്കോട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,കൊഴിക്കൊട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,കോഴിക്കോട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "മെഡിക്കല്‍ കോളേജ് ആശുപത്രി,കോഴിക്കോട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "താലുക്ക് ആശുപത്രി,പെരുംബ്ര",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "താലുക്ക് ആശുപത്രി,താമരശേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ബേബി മെമ്മോറിയല്‍ ആശുപത്രി,കോഴിക്കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "കാലിക്കറ്റ്‌ സിറ്റി സര്‍വീസ് കോ-ഓപ്പെറെറ്റിവ് ബാങ്ക് ഡയാലിസ്സെന്‍റെര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ജില്ല കോ ഓപ്പെററ്റിവ് ആശുപത്രി,കോഴിക്കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ഫാത്തിമ ആശുപത്രി,കോഴിക്കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ഐ-ക്യു-ആര്‍-എ-എ ഇന്റര്‍നാഷണല്‍ ആശുപത്രി,മലപറമ്പ",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "കെ-എം-സി-ടി മെഡിക്കല്‍ കോളേജ്,കോഴിക്കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "കോയാസ് ആശുപത്രി,ഫെറോകെ,കോഴിക്കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "കോഴിക്കോട് ജില്ല കോഓപ്പെററ്റിവ് ആശുപത്രി,ഏറനിപാലം",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "മലബാര്‍ മെഡിക്കല്‍ കോളേജ്,മോടകല്ലൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "മിംസ് ആശുപത്രി,ബടഗര",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "മിംസ് തണല്‍ ആശുപത്രി,വടകര",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "പി.വി.എസ്.ആശുപത്രി,കോഴിക്കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ശാന്തി ആശുപത്രി,ഓമശ്ശേരി  ",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കോഴിക്കോട്",
                    "HOSP": "ശിഹാബ് തങ്ങള്‍ ഡയാലിസിസ് സെന്‍റെര്‍,കോഴിക്കോട്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "സി എച് സി, മാനന്തവാടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "സി എച് സി, മീനങ്ങാടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "ജില്ല ആശുപത്രി,മാനന്തവാടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "ഗവ:ട്രൈബല്‍ ആശുപത്രി,നല്ലൂര്നാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "പി എച് സി,വരടൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,ബത്തേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "ഡി എം വയനാട് ഇന്‍സ്റ്റിറ്റ്യൂട്ട് ഓഫ് മെഡിക്കല്‍ സയന്‍സ്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "ഫാത്തിമ മാതാ മിഷന്‍ ആശുപത്രി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "വയനാട്",
                    "HOSP": "ശാന്തി ഫ്രീ ആന്‍ഡ്‌ ഡയാലിസിസ് യുണിറ്റ്,കല്‍പ്പറ്റ",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "ജില്ല ആശുപത്രി,കണ്ണൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,തലശ്ശേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "മലബാര്‍ കാന്‍സര്‍ സെന്‍റെര്‍,തലശ്ശേരി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,തളിപ്പറമ്പ്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "താലുക്ക് ആശുപത്രി,കണ്ണൂര്‍",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "എ കെ ജി മെമ്മോറിയല്‍ ആശുപത്രി,തലപ്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "കണ്ണൂര്‍ മെഡിക്കല്‍ കോളേജ്,അന്ജരക്കണ്ടി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "കൊയിലി ആശുപത്രി,കണ്ണൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കണ്ണൂര്‍",
                    "HOSP": "ടെല്ലിചേരി കോഓപ്പെററ്റിവ് ആശുപത്രി,കണ്ണൂര്‍",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "സി എച് സി,ബോവിക്കാനം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "സി എച് സി,പന്താടി",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "ജില്ല ആശുപത്രി,കാഞ്ഞങ്ങാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "ജില്ല ടി ബി സെന്‍റെര്‍,കാസര്‍ഗോഡ്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "ജനറല്‍ ആശുപത്രി,കാസര്‍ഗോഡ്‌",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "കെ.കെ.മെമ്മോറിയല്‍ പി എച് സി,കൊന്നക്കാട്",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "പി എച് സി,തുരുത്തി,കാസര്‍ഗോഡ്‌",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "പി എച് സി,മുല്ലേറിയ",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "താലുക്ക് ഹെഡ് കോര്‍ട്ടേഴ്സ് ആശുപത്രി,നീലേശ്വരം",
                    "SECTOR": "ഗവ: ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "അഹല്യ ഫൌണ്ടേഷന്‍ കണ്ണ്‍ ആശുപത്രി,കാസര്‍ഗോഡ്‌",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "കെയര്‍ വെല്‍ ആശുപത്രി,നുള്ളിപ്പടി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "ലക്ഷ്മി മേഘന്‍ സ്പെഷാലിറ്റി ആശുപത്രി,കൊവ്വല്‍പള്ളി",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                },
                {
                    "PLACE": "കാസര്‍ഗോഡ്‌",
                    "HOSP": "മാലിക് ദീനാര്‍ ചാരിറ്റബള്‍ ആശുപത്രി,കാസര്‍ഗോഡ്",
                    "SECTOR": "പ്രൈവറ്റ് ആശുപത്രി"
                }
            ];
            var masterHospitals = {};




            masterHospitals.getHospitalsForDistrict = function (distName) {
                var mastHospitals = [];
                
                angular.forEach(hospitals, function (value, key) {
    
                    if (value.PLACE == distName) {
                        mastHospitals.push(value);
                        //console.log(JSON.stringify(value));
                    }
                });
                return mastHospitals;

            }

            return masterHospitals;

        });
